Tekla Open API Reference for Tekla Structures 2025
Drawing.GetIdsOfUnnumberedDrawings Method
 Returns the list of identifiers of those drawings in the input that are NOT up to date regarding numbering in the drawing
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static IList<Identifier> GetIdsOfUnnumberedDrawings(
	IList<Drawing> drawingsToBeChecked
)
Public Shared Function GetIdsOfUnnumberedDrawings (
	drawingsToBeChecked As IList(Of Drawing)
) As IList(Of Identifier)
Parameters
drawingsToBeChecked
Type: System.Collections.Generic.IList<Drawing>
The list of drawings that we want to check for numbering status
Return Value
Type: IList<Identifier>
List of the unnumbered drawings' IDs
See Also
Reference
Drawing Class
Tekla.Structures.Drawing Namespace